
"" + 1 + 0 = 10
"" - 1 + 0 = -1
true + false = 1
6 / "3" = 2
"2" * "3" = 6
4 + 5 + "px" = "9px" (предпалагаю,что так,но не всегда понятно когда нужно нормально плюсовать,а когда просто ставить рядом 
число по моей логике работает так что если спереди стоят ковычки,то мы число ставим рядом просто,а если ковычки сзади 
то у нас происходит математическое действие и потом только добавляем ковычки и значок либо надпись и тд)
"$" + 4 + 5 = "$45"	
"4" - 2 = 2
"4px" - 2 = Nan
"  -9  " + 5 = -4
"  -9  " - 5 = -14
null + 1 = 1
undefined + 1 = Nan




Операторы сравнения
Каким будет результат этих выражений?


5 > 4 = true
"ананас" > "яблоко" = true (на уроке был пример,что 3 буква не совпала(поэтому была true)Тут непонятно
 потому что с самого начала буквы не совпадают,так что тут рандом)
"2" > "12" = false
undefined == null = true
undefined === null = false
null == "\n0\n" = true (Как я понимаю вторая запись это none(значит ничего=0) 0=0 true
null === +"\n0\n" = false 
